{
    "components": {
        "header": {
            "urls": {
                "about": "Sobre mí", 
                "experience": "Experiencia",
                "projects": "Proyectos", 
                "skills": "Conocimientos",
                "contact": "Contacto"
            }
        },
        "divider": {
            "years_of_experience": "Años de experiencia",
            "projects_completed": "Proyectos completados",
            "technologies": "Tecnologías dominadas"
        },
        "about": {
            "title": "Sobre <0>mí</0>",
            "content": "Desde los 15 años, he estado inmerso en el mundo de la programación, contribuyendo a proyectos innovadores. Actualmente, formo parte de un equipo dinámico donde diseño y desarrollo soluciones tecnológicas. Barcelona ha sido mi inspiración, y mi enfoque fullstack me ha permitido abordar desafíos desde la interfaz de usuario hasta la lógica del servidor. Me apasiona la tecnología, la colaboración en equipos multidisciplinarios y la constante mejora profesional.",
            "download_cv": "Descargar CV", 
            "contact_me": "Contáctame"
        },
        "softskills": {
            "comunication": {
                "title": "Comunicación efectiva", 
                "content": "Capacidad para transmitir ideas de manera clara y concisa, tanto en inglés como en español."
            },
            "teamwork": {
                "title": "Trabajo en equipo", 
                "content": "Experiencia en equipos multidisciplinarios, con habilidades para liderar y colaborar."
            },
            "problem_solving": {
                "title": "Resolución de problemas", 
                "content": "Habilidad para identificar y resolver problemas de manera eficiente y efectiva."
            },
            "creativity": {
                "title": "Creatividad", 
                "content": "Capacidad para aportar ideas innovadoras y soluciones creativas a los proyectos."
            },
            "critical_thinking": {
                "title": "Pensamiento crítico", 
                "content": "Habilidad para analizar y evaluar situaciones complejas y tomar decisiones fundamentadas."
            }
        },
        "experience": {
            "working": "Experiencia <0>laboral</0>",
            "educational": "Experiencia <0>educativa</0>",
            "elements": {
                "avannubo": {
                    "position": "Desarrollador Fullstack",
                    "date": "Febrero 2023 - Actualidad", 
                    "description": "En mi trayectoria como desarrollador fullstack, inicié mi recorrido enfocándome en el desarrollo de aplicaciones internas para la empresa. A medida que adquiría experiencia, amplié mi alcance hacia la creación integral de aplicativos para clientes externos. Progresivamente, asumí roles más complejos, desempeñando funciones que incluían la gestión de tareas, la toma de requisitos y el desarrollo completo de plataformas."
                },
                "sosmatic": {
                    "position": "Helpdesk", 
                    "date": "Octubre 2022 - Febrero 2023",
                    "description": "Durante mi experiencia laboral, desempeñé el rol de soporte de helpdesk, gestionando llamadas y reportes de incidencias de nivel 1 para múltiples compañías subcontratadas. Mi responsabilidad abarcaba más de 7 servicios, cada uno perteneciente a empresas diversas. Mis tareas incluían la resolución de problemas relacionados con fibra óptica, radioenlace, roaming, datos móviles, consultas sobre servicios, y telefonía fija, entre otros."
                },
                "freelancer": {
                    "position": "Desarrollador",
                    "date": "Octubre 2020 - Octubre 2022", 
                    "description": "Después de sumergirme en el ámbito del desarrollo, inicié mi trayectoria como freelancer mientras continuaba mi formación. Me ocupaba de brindar servicios a clientes en la plataforma Cfx.re, también conocida como FiveM. En este contexto, desarrollaba scripts en Lua destinados a mejorar la experiencia de juego en el ámbito del roleplay. Con el tiempo, amplié mis habilidades al integrar complejas interfaces web sincronizadas con el juego mediante jQuery y ReactJs. Paralelamente, diseñé plataformas externas al juego para gestionar servidores de manera eficiente. En un momento determinado, tomé la decisión de dar el salto completo hacia el desarrollo web, lo que implicó cerrar mis servicios como freelancer para dedicar exclusivamente mi tiempo al proceso de aprendizaje."
                },
                "smx": {
                    "position": "Sistemas Microinformáticos y Redes",
                    "date": "Septiembre 2019 - Junio 2021",
                    "description": "Durante mi formación en sistemas microinformáticos y redes, adquirí habilidades especializadas en la configuración y mantenimiento de sistemas, así como en la gestión de redes. Este ciclo me proporcionó un profundo entendimiento de la infraestructura microinformática, desde la resolución de problemas en hardware hasta la implementación de soluciones de red."
                },
                "daw": {
                    "position": "Desarrollo de Aplicaciones Web",
                    "date": "Septiembre 2021 - Junio 2023",
                    "description": "En mi travesía hacia el desarrollo de aplicaciones web, previamente me embarqué en un camino autodidacta que abarcó más de 2 años. Durante este tiempo, me sumergí en la exploración independiente de lenguajes de programación, frameworks y metodologías de desarrollo. A medida que adquiría experiencia, comprendí la importancia de formalizar mis conocimientos y habilidades para acceder al mercado laboral de manera más sólida. Fue en este contexto que decidí ingresar al ciclo de desarrollo de aplicaciones web. Mi objetivo principal era complementar mi aprendizaje autodidacta con una formación más estructurada y académica"
                }
            }
        },
        "projects": {
            "title": "Proyectos <0>destacados</0>",
            "description": "Mis últimos proyectos destacados, por motivos de privacidad no puedo mostrar todos los proyectos en los que he trabajado laboralmente.",
            "status": {
                "working_on": "En desarrollo", 
                "done": "Finalizado"
            },
            "elements": {
                "portal": {
                    "title": "Portal Empresarial", 
                    "description": "Aplicativo para la gestión simulada de empresas y entornos de mercado en colaboración con Monlau Group"
                },
                "codishare": {
                    "title": "Codishare", 
                    "description": "Una plataforma de código abierto para compartir y colaborar en proyectos de desarrollo"
                }
            },
            "actions": {
                "url": "Ver proyecto",
                "source": "Ver código fuente"
            }
        }
    },
    "pages": {
        "index": {
            "welcome": "Bienvenido a mi sitio web personal", 
            "title": "Soy <0>Xavier Morell</0>, desarrollador <1>fullstack</1>",
            "subtitle": "Nacido y residente en Barcelona, especializado en el desarrollo integral de aplicaciones web y móviles. Fanático de la tecnología y el desarrollo de software."
        }
    }
}